Yanfreak/WAV-Player-STM32/Project/音视频模块/BMP图像解码实验/jpegdecode.c
#include "jpegbmp.h"    
#include "stm322xg_eval_lcd.h"
#include "ff.h"
#include "bmp.h"
#include "stm32_eval.h"
#include "string.h"
#include "malloc.h"


//不使用内存分配
#if BMP_USE_MALLOC == 0	
FIL f_bfile;
u8 bmpreadbuf[2048];
#endif 		

//图像信息
extern FRESULT ret;	/* Result code */
extern FIL file;   /* File object */
typedef struct
{			 
	u32 ImgWidth; //图像的实际宽度和高度
	u32 ImgHeight;

	u32 Div_Fac;  //缩放系数 (扩大了10000倍的)
	
	u32 S_Height; //设定的高度和宽度
	u32 S_Width;
	
	u32	S_XOFF;	  //x轴和y轴的偏移量
	u32 S_YOFF;

	u32 staticx;  //当前显示到的ｘｙ坐标
	u32 staticy;
}PIC_POS;
		  
PIC_POS PICINFO;//图像位置信息
_pic_phy pic_phy;	//图片显示物理接口，定义在bmp.h	
////////////////////////////////////////////////////  
void AI_Drow_Init(void);        //智能画图,初始化.得到比例因子PICINFO.Div_Fac	   
/////////////////////////////////////////////////////    
//在JPEG函数里面用到的变量
short			SampRate_Y_H,SampRate_Y_V;
short			SampRate_U_H,SampRate_U_V;
short			SampRate_V_H,SampRate_V_V;
short			H_YtoU,V_YtoU,H_YtoV,V_YtoV;
short			Y_in_MCU,U_in_MCU,V_in_MCU;			   
unsigned char   *lp;//取代lpJpegBuf
short			qt_table[3][64];
short			comp_num;
u8			comp_index[3];
u8		    YDcIndex,YAcIndex,UVDcIndex,UVAcIndex;
u8			HufTabIndex;
short		    *YQtTable,*UQtTable,*VQtTable;
short		    code_pos_table[4][16],code_len_table[4][16];
unsigned short	code_value_table[4][256];
unsigned short	huf_max_value[4][16],huf_min_value[4][16];
short			BitPos,CurByte;//byte的第几位,当前byte
short			rrun,vvalue;
short			MCUBuffer[10*64];    
short			QtZzMCUBuffer[10*64];
short			BlockBuffer[64];
short			ycoef,ucoef,vcoef;
BOOL			IntervalFlag;
short			interval=0;
short			Y[4*64],U[4*64],V[4*64];//
DWORD		    sizei,sizej;
short 			restart;
long iclip[1024];//4k BYTES
long *iclp;	
//反Z字形编码表
const int Zig_Zag[8][8]={{0,1,5,6,14,15,27,28},
					  	  {2,4,7,13,16,26,29,42},
						  {3,8,12,17,25,30,41,43},
						  {9,11,18,24,31,40,44,53},
						  {10,19,23,32,39,45,52,54},
						  {20,22,33,38,46,51,55,60},
						  {21,34,37,47,50,56,59,61},
						  {35,36,48,49,57,58,62,63}
						 };
const BYTE And[9]={0,1,3,7,0xf,0x1f,0x3f,0x7f,0xff};
//数据缓冲区		  
unsigned char jpg_buffer[1024];//数据缓存区	
/////////////////////////////////////////////////////    
//初始化智能画点
void AI_Drow_Init(void)
{
	float temp,temp1;	   
	temp=(float)PICINFO.S_Width/PICINFO.ImgWidth;
	temp1=(float)PICINFO.S_Height/PICINFO.ImgHeight;
						 
	if(temp<temp1)temp1=temp;//取较小的那个	 
	if(temp1>1)temp1=1;	  
	//使图片处于所给区域的中间
	PICINFO.S_XOFF+=(PICINFO.S_Width-temp1*PICINFO.ImgWidth)/2;
	PICINFO.S_YOFF+=(PICINFO.S_Height-temp1*PICINFO.ImgHeight)/2;
	temp1*=10000;//扩大10000倍	 
	PICINFO.Div_Fac=temp1;
			   
	PICINFO.staticx=500;
	PICINFO.staticy=500;//放到一个不可能的值上面			 										    
}   
//判断这个像素是否可以显示
//(x,y) :像素原始坐标
//chg   :功能变量. 
//返回值:0,不需要显示.1,需要显示
__inline u8 IsElementOk(u16 x,u16 y,u8 chg)
{				  
	if(x!=PICINFO.staticx||y!=PICINFO.staticy)
	{
		if(chg==1)
		{
			PICINFO.staticx=x;
			PICINFO.staticy=y;
		} 
		return 1;
	}
	else return 0;
}
//智能画图
//FileName:要显示的图片文件  BMP/JPG/JPEG
//(sx,sy) :开始显示的坐标点
//(ex,ey) :结束显示的坐标点
//图片在开始和结束的坐标点范围内显示
BOOL AI_LoadPicFile(u8 *FileName,u16 sx,u16 sy,u16 ex,u16 ey)
{	
	int	funcret;//返回值	
	UINT rett;

	//得到显示方框大小	  	 
	if(ey>sy)PICINFO.S_Height=ey-sy;
	else PICINFO.S_Height=sy-ey;	 
	if(ex>sx)PICINFO.S_Width=ex-sx;
	else PICINFO.S_Width=sx-ex;
	//显示区域无效
	if(PICINFO.S_Height==0||PICINFO.S_Width==0)
	{
		PICINFO.S_Height=LCD_H;
		PICINFO.S_Width=LCD_W;
		return FALSE;   
	}

	//影响速度
	//SD_Init();//初始化SD卡，在意外拔出之后可以正常使用
	//显示的开始坐标点
	PICINFO.S_YOFF=sy;
	PICINFO.S_XOFF=sx;		 
	ret=f_open(&file,FileName,FA_READ);

	//开始时读入1024个字节到缓存里面.方便后面提取JPEG解码的信息
	f_read(&file,jpg_buffer,512,&rett);	   //读第一次
    f_lseek(&file,512);
	f_read(&file,jpg_buffer+512,512,&rett);//读第二次
											   
	InitTable(); //初始化各个数据表 
	if((funcret=InitTag())!=FUNC_OK)return FALSE;//初始化表头不成功    
	if((SampRate_Y_H==0)||(SampRate_Y_V==0))return FALSE ;//采样率错误  
	AI_Drow_Init();  //初始化PICINFO.Div_Fac,启动智能画图	   
	funcret=Decode();//解码JPEG开始
	if(funcret==FUNC_OK)return TRUE;//解码成功
	else return FALSE;   //解码失败	
}

//智能画图
//FileName:要显示的图片文件  BMP/JPG/JPEG
//(sx,sy) :开始显示的坐标点
//(ex,ey) :结束显示的坐标点
//图片在开始和结束的坐标点范围内显示
BOOL AI_LoadPicFile_bmp(u8 *FileName,u16 sx,u16 sy,u16 ex,u16 ey)
{	
	//得到显示方框大小	  	 
	if(ey>sy)PICINFO.S_Height=ey-sy;
	else PICINFO.S_Height=sy-ey;	 
	if(ex>sx)PICINFO.S_Width=ex-sx;
	else PICINFO.S_Width=sx-ex;
	//显示区域无效
	if(PICINFO.S_Height==0||PICINFO.S_Width==0)
	{
		PICINFO.S_Height=LCD_H;
		PICINFO.S_Width=LCD_W;
		return FALSE;   
	}

	//影响速度
	//SD_Init();//初始化SD卡，在意外拔出之后可以正常使用
	//显示的开始坐标点
	PICINFO.S_YOFF=sy;
	PICINFO.S_XOFF=sx;	
	//文件名传递		 
	stdbmp_decode(FileName); //解码bmp	  	  										   
	return 1;
}

#if 1
//标准的bmp解码,解码filename这个BMP文件	
//速度比较慢.主要	
//filename:包含路径的文件名	 	      	  			  
//返回值:0,成功;
//其他,错误码.
u8 stdbmp_decode(const u8 *filename) 
{
	FIL* f_bmp;
    u16 br;

    u16 count;		    	   
	u8  rgb ,color_byte;
	u16 x ,y,color;	  
	u16 countpix=0;//记录像素 	 

	//x,y的实际坐标	
	u16  realx=0;
	u16 realy=0;
	u8  yok=1;  				   
	u8 res;

	u8 *databuf;    		//数据读取存放地址
 	u16 readlen=1*1024;		//一次从SD卡读取的字节数长度

	u8 *bmpbuf;			  	//数据解码地址
	u8 biCompression=0;		//记录压缩方式
	
	u16 rowlen;	  		 	//水平方向字节数  
	BITMAPINFO *pbmp;		//临时指针
	
#if BMP_USE_MALLOC == 1	//使用malloc	
	databuf=(u8*)mymalloc(SRAMIN,readlen);		//开辟readlen字节的内存区域
	if(databuf==NULL)return PIC_MEM_ERR;	//内存申请失败.
	f_bmp=(FIL *)mymalloc(SRAMIN,sizeof(FIL));	//开辟FIL字节的内存区域 
	if(f_bmp==NULL)							//内存申请失败.
	{		 
		myfree(SRAMIN,databuf);
		return PIC_MEM_ERR;				
	} 	 
#else	//不使用malloc
	databuf=bmpreadbuf;
	f_bmp=&f_bfile;
#endif
	res=f_open(f_bmp,(const TCHAR*)filename,FA_READ);//打开文件	 						  
	if(res==0)//打开成功.
	{ 
		f_read(f_bmp,databuf,readlen,(UINT*)&br);	//读出readlen个字节  
		pbmp=(BITMAPINFO*)databuf;					//得到BMP的头部信息   
		count=pbmp->bmfHeader.bfOffBits;        	//数据偏移,得到数据段的开始地址
		color_byte=pbmp->bmiHeader.biBitCount/8;	//彩色位 16/24/32  
		biCompression=pbmp->bmiHeader.biCompression;//压缩方式
		PICINFO.ImgHeight=pbmp->bmiHeader.biHeight;	//得到图片高度
		PICINFO.ImgWidth=pbmp->bmiHeader.biWidth;  	//得到图片宽度   
		//水平像素必须是4的倍数!!
		if((PICINFO.ImgWidth*color_byte)%4)rowlen=((PICINFO.ImgWidth*color_byte)/4+1)*4;
		else rowlen=PICINFO.ImgWidth*color_byte;
		AI_Drow_Init();//初始化智能画图	    
		
		//开始解码BMP   
		color=0;//颜色清空	 													 
		x=0;
		y=PICINFO.ImgHeight;
		rgb=0;      
		//对于尺寸小于等于设定尺寸的图片,进行快速解码
		realy=y*PICINFO.Div_Fac/10000;
		bmpbuf=databuf;
		while(1)
		{				 
			while(count<1024)  //读 取一簇1024扇区 (SectorsPerClust 每簇扇区数)
		    {
				if(color_byte==3) //24位颜色图
				{
					switch (rgb) 
					{
						case 0:				  
							color=bmpbuf[count]>>3; //B
							break ;	   
						case 1: 	 
							color+=((u16)bmpbuf[count]<<3)&0X07E0;//G
							break;	  
						case 2 : 
							color+=((u16)bmpbuf[count]<<8)&0XF800;//R	  
							break ;			
					}   
				}else if(color_byte==2) //16位颜色图
				{
					switch(rgb)
					{
						case 0 : 
							if(biCompression==BI_RGB)//RGB:5,5,5
							{
								color=((u16)bmpbuf[count]&0X1F);	 	//R
								color+=(((u16)bmpbuf[count])&0XE0)<<1; //G
							}else		//RGB:5,6,5
							{
								color=bmpbuf[count];  			//G,B
							}  
							break ;   
						case 1 : 			  			 
							if(biCompression==BI_RGB)//RGB:5,5,5
							{
								color+=(u16)bmpbuf[count]<<9;  //R,G
							}else  		//RGB:5,6,5
							{
								color+=(u16)bmpbuf[count]<<8;	//R,G
							}  									 
							break ;	 
					}		     
				}else if(color_byte==4)//32位颜色图
				{
					switch (rgb)
					{
						case 0:				  
							color=bmpbuf[count]>>3; //B
							break ;	   
						case 1: 	 
							color+=((u16)bmpbuf[count]<<3)&0X07E0;//G
							break;	  
						case 2 : 
							color+=((u16)bmpbuf[count]<<8)&0XF800;//R
							break ;			
						case 3 :
							break ;  		  	 
					}	
				}else if(color_byte==1)//8位色,暂时不支持,需要用到颜色表.
				{
				}
 
