Yanfreak/WAV-Player-STM32/Project/音视频模块/BMP图像解码实验/jpegdecode.c
	for(i=0;i<10*64;i++){
		MCUBuffer[i]=0;
		QtZzMCUBuffer[i]=0;
	}
	for(i=0;i<64;i++){
		Y[i]=0;
		U[i]=0;
		V[i]=0;
		BlockBuffer[i]=0;
	}
	ycoef=ucoef=vcoef=0;
}
//调用顺序: Initialize_Fast_IDCT() :初始化 
//          DecodeMCUBlock()       Huffman Decode 
//          IQtIZzMCUComponent()   反量化、反DCT 
//          GetYUV()               Get Y U V 
//          StoreBuffer()          YUV to RGB 
int Decode(void)
{
	int funcret;

	Y_in_MCU=SampRate_Y_H*SampRate_Y_V;//YDU YDU YDU YDU
	U_in_MCU=SampRate_U_H*SampRate_U_V;//cRDU 
	V_in_MCU=SampRate_V_H*SampRate_V_V;//cBDU
	H_YtoU=SampRate_Y_H/SampRate_U_H;
	V_YtoU=SampRate_Y_V/SampRate_U_V;
	H_YtoV=SampRate_Y_H/SampRate_V_H;
	V_YtoV=SampRate_Y_V/SampRate_V_V;
	Initialize_Fast_IDCT();
	while((funcret=DecodeMCUBlock())==FUNC_OK) //After Call DecodeMCUBUBlock()
	{
		interval++;						      //The Digital has been Huffman Decoded and 
		if((restart)&&(interval % restart==0))//be stored in MCUBuffer(YDU,YDU,YDU,YDU		        
			 IntervalFlag=TRUE;				  // UDU,VDU) Every DU := 8*8 
		else
			IntervalFlag=FALSE;
		IQtIZzMCUComponent(0); //反量化 and IDCT The Data in QtZzMCUBuffer 
		IQtIZzMCUComponent(1);
		IQtIZzMCUComponent(2);
		GetYUV(0);			   //得到Y cR cB 
		GetYUV(1);
		GetYUV(2);
		StoreBuffer();		   //To RGB
		sizej+=SampRate_Y_H*8;
		if(sizej>=PICINFO.ImgWidth)
		{
			sizej=0;
			sizei+=SampRate_Y_V*8;
		}
		if ((sizej==0)&&(sizei>=PICINFO.ImgHeight))break;	  
	}
	return funcret;
}
// 入口 QtZzMCUBuffer 出口 Y[] U[] V[] 
//得到YUV色彩空间   
void  GetYUV(short flag)
{
	short	H,VV;
	short	i,j,k,h;
	short	*buf;
	short	*pQtZzMCU;	  
	switch(flag)
	{
		case 0://亮度分量
			H=SampRate_Y_H;
			VV=SampRate_Y_V;
			buf=Y;
			pQtZzMCU=QtZzMCUBuffer;
			break;
		case 1://红色分量
			H=SampRate_U_H;
			VV=SampRate_U_V;
			buf=U;
			pQtZzMCU=QtZzMCUBuffer+Y_in_MCU*64;
			break;
		case 2://蓝色分量
			H=SampRate_V_H;
			VV=SampRate_V_V;
			buf=V;
			pQtZzMCU=QtZzMCUBuffer+(Y_in_MCU+U_in_MCU)*64;
			break;
	}
	for (i=0;i<VV;i++)
		for(j=0;j<H;j++)
			for(k=0;k<8;k++)
				for(h=0;h<8;h++)
					buf[(i*8+k)*SampRate_Y_H*8+j*8+h]=*pQtZzMCU++;
}
  
//将解出的字按RGB形式存储 lpbmp (BGR),(BGR) ......入口Y[] U[] V[] 出口lpPtr	  
void StoreBuffer(void)
{
	short i=0,j=0;			    
	unsigned char R,G,B;
	int y,u,v,rr,gg,bb;
	u16 color;
	//x,y的实际坐标	
	u16 realx=sizej;
	u16 realy=0;
		    
	for(i=0;i<SampRate_Y_V*8;i++)
	{	    
		if((sizei+i)<PICINFO.ImgHeight)// sizei表示行 sizej 表示列 
		{										   
			realy=PICINFO.Div_Fac*(sizei+i)/10000;//实际Y坐标											 
			//在这里不改变PICINFO.staticx和PICINFO.staticy的值 ,如果在这里改变,则会造成每块的第一个点不显示!!!
			if(!IsElementOk(realx,realy,0))continue;//列值是否满足条件? 寻找满足条件的列
																										    
			for(j=0;j<SampRate_Y_H*8;j++)
			{
				if((sizej+j)<PICINFO.ImgWidth)
				{
					realx=PICINFO.Div_Fac*(sizej+j)/10000;//实际X坐标	   
					//在这里改变PICINFO.staticx和PICINFO.staticy的值
					if(!IsElementOk(realx,realy,1))continue;//列值是否满足条件? 寻找满足条件的行
																						    
					y=Y[i*8*SampRate_Y_H+j];
					u=U[(i/V_YtoU)*8*SampRate_Y_H+j/H_YtoU];
					v=V[(i/V_YtoV)*8*SampRate_Y_H+j/H_YtoV];
					rr=((y<<8)+18*u+367*v)>>8;
					gg=((y<<8)-159*u-220*v)>>8;
					bb=((y<<8)+411*u-29*v)>>8;
					R=(unsigned char)rr;
					G=(unsigned char)gg;
					B=(unsigned char)bb;
					if (rr&0xffffff00) if (rr>255) R=255; else if (rr<0) R=0;
					if (gg&0xffffff00) if (gg>255) G=255; else if (gg<0) G=0;
					if (bb&0xffffff00) if (bb>255) B=255; else if (bb<0) B=0;  
					color=R>>3;
					color=color<<6;
					color |=(G>>2);
					color=color<<5;
					color |=(B>>3);			   
					//在这里送给LCD显示 
					POINT_COLOR=color;  	    
					LCD_DrawPoint(realx+PICINFO.S_XOFF,realy+PICINFO.S_YOFF,POINT_COLOR);//显示图片		 
				}
				else break;
			} 	    
		}
		else break;
	}
}
//Huffman Decode   MCU 出口 MCUBuffer  入口Blockbuffer[  ] 
int DecodeMCUBlock(void)
{
	short *lpMCUBuffer;
	short i,j;
	int funcret;  
	if (IntervalFlag)//差值复位 
	{			    
		lp+=2;  
		lp-=P_Cal(lp);	 
		ycoef=ucoef=vcoef=0;
		BitPos=0;
		CurByte=0;
	}
	switch(comp_num)
	{
		case 3:	 //comp_num 指图的类型（彩色图、灰度图） 
			lpMCUBuffer=MCUBuffer;
			for (i=0;i<SampRate_Y_H*SampRate_Y_V;i++)  //Y
			{
				funcret=HufBlock(YDcIndex,YAcIndex);//解码4 * (8*8) 
				if (funcret!=FUNC_OK)
					return funcret;
				BlockBuffer[0]=BlockBuffer[0]+ycoef;//直流分量是差值，所以要累加。
				ycoef=BlockBuffer[0];
				for (j=0;j<64;j++)
					*lpMCUBuffer++=BlockBuffer[j];
			}
			for (i=0;i<SampRate_U_H*SampRate_U_V;i++)  //U
			{
				funcret=HufBlock(UVDcIndex,UVAcIndex);
				if (funcret!=FUNC_OK)
					return funcret;
				BlockBuffer[0]=BlockBuffer[0]+ucoef;
				ucoef=BlockBuffer[0];
				for (j=0;j<64;j++)
					*lpMCUBuffer++=BlockBuffer[j];
			}
			for (i=0;i<SampRate_V_H*SampRate_V_V;i++)  //V
			{
				funcret=HufBlock(UVDcIndex,UVAcIndex);
				if (funcret!=FUNC_OK)
					return funcret;
				BlockBuffer[0]=BlockBuffer[0]+vcoef;
				vcoef=BlockBuffer[0];
				for (j=0;j<64;j++)
					*lpMCUBuffer++=BlockBuffer[j];
			}
			break;
		case 1:	//Gray Picture 
			lpMCUBuffer=MCUBuffer;
			funcret=HufBlock(YDcIndex,YAcIndex);
			if (funcret!=FUNC_OK)
				return funcret;
			BlockBuffer[0]=BlockBuffer[0]+ycoef;
			ycoef=BlockBuffer[0];
			for (j=0;j<64;j++)
				*lpMCUBuffer++=BlockBuffer[j];
			for (i=0;i<128;i++)
				*lpMCUBuffer++=0;
			break;
		default:
			return FUNC_FORMAT_ERROR;
	}
	return FUNC_OK;
}
//Huffman Decode （8*8） DU   出口 Blockbuffer[ ] 入口 vvalue 
int HufBlock(u8 dchufindex,u8 achufindex)
{
	short count=0;
	short i;
	int funcret;   
	//dc
	HufTabIndex=dchufindex;
	funcret=DecodeElement();
	if(funcret!=FUNC_OK)return funcret;	  
	BlockBuffer[count++]=vvalue;//解出的直流系数 
	//ac
	HufTabIndex=achufindex;
	while (count<64)
	{
		funcret=DecodeElement();
		if(funcret!=FUNC_OK)
			return funcret;
		if ((rrun==0)&&(vvalue==0))
		{
			for (i=count;i<64;i++)BlockBuffer[i]=0;	 
			count=64;
		}
		else
		{						    
			for (i=0;i<rrun;i++)BlockBuffer[count++]=0;//前面的零	 
			BlockBuffer[count++]=vvalue;//解出的值 
		}
	}
	return FUNC_OK;
}
//Huffman 解码  每个元素   出口 vvalue 入口 读文件ReadByte 
int DecodeElement()
{
	int thiscode,tempcode;
	unsigned short temp,valueex;
	short codelen;
	u8 hufexbyte,runsize,tempsize,sign;
	u8 newbyte,lastbyte;

